Revit 2026 API

# FieldDomainPointsByUV(IListUV) Constructor

---

Initializes a new instance of the FieldDomainPointsByUV class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldDomainPointsByUV(
	IList<UV> points
)
```
```vb
Public Sub New (
	points As IList(Of UV)
)
```
```cpp
public:
FieldDomainPointsByUV(
	IList<UV^>^ points
)
```
```fsharp
new :
        points : IList<UV> -> FieldDomainPointsByUV
```

#### Parameters

points IListUV

#### Reference

FieldDomainPointsByUV Class

FieldDomainPointsByUV Overload

Autodesk.Revit.DB.Analysis Namespace